eac-core/eac/eacWebServiceApp/src/test/resources/soap/header/soap4WithSecurityHeaderOutput.xml

<soapenv:Envelope xmlns:eac="http://eac.oup.com/eac-user-data-services" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:extra="http://test/extra">
   <soapenv:Header>
      <extra:before/>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>admin</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Passw0rd</wsse:Password>
			<extra:before/>
            <extra:after/>
         </wsse:UsernameToken>
      </wsse:Security>
     <extra:after/>
   </soapenv:Header>
   <soapenv:Body>
      <eac:UserNameRequest>
         <eac:sessionToken>ABCDEF</eac:sessionToken>
      </eac:UserNameRequest>
   </soapenv:Body>
</soapenv:Envelope>